Repository: kemreakkas/xpire-1
Catalog: lib/l10n/app_*.arb
Languages: tr

source: Sign in
tr: Giriş yap

source: Create account
tr: Hesap oluştur

source: Email
tr: E-posta

# emailHint
source: you@example.com
tr: ornek@email.com

source: Password
tr: Şifre

source: Confirm password
tr: Şifre tekrar

# enterEmail
source: Enter your email
tr: E-postanızı girin

# enterValidEmail
source: Enter a valid email
tr: Geçerli bir e-posta girin

# enterPassword
source: Enter your password
tr: Şifrenizi girin

# atLeast6Chars
source: At least 6 characters
tr: En az 6 karakter

source: Passwords do not match
tr: Şifreler eşleşmiyor

# alreadyHaveAccount
source: Already have an account? Sign in
tr: Zaten hesabınız var mı? Giriş yap

# supabaseNotConfigured
source: Supabase is not configured. Set SUPABASE_URL and SUPABASE_ANON_KEY.
tr: Supabase yapılandırılmadı. SUPABASE_URL ve SUPABASE_ANON_KEY ayarlayın.

source: Auth error
tr: Kimlik doğrulama hatası

source: Stats
tr: İstatistikler

source: Profile
tr: Profil

source: Level
tr: Seviye

source: Total XP
tr: Toplam XP

source: Streak
tr: Seri

# premiumActive
source: Active
tr: Aktif

# premiumNotActive
source: Not active
tr: Aktif değil

source: Upgrade to Premium
tr: Premium'a geç

source: Sign out
tr: Çıkış yap

source: Your info
tr: Bilgileriniz

source: Full name
tr: Ad soyad

source: Username
tr: Kullanıcı adı

source: Age
tr: Yaş

source: Occupation
tr: Meslek

source: Focus category
tr: Odak kategorisi

source: Optional
tr: İsteğe bağlı

source: None
tr: Yok

source: Save profile
tr: Profili kaydet

source: Profile saved
tr: Profil kaydedildi

source: New goal
tr: Yeni hedef

source: Create Custom
tr: Özel oluştur

source: Use Template
tr: Şablon kullan

source: Title
tr: Başlık

source: Category
tr: Kategori

source: Difficulty
tr: Zorluk

# enterTitle
source: Enter a title
tr: Bir başlık girin

# keepLonger
source: Keep it a bit longer
tr: Biraz daha uzun yazın

source: Save
tr: Kaydet

source: All
tr: Tümü

# fromTemplate
source: From template: {title}
tr: Şablondan: {title}

source: Daily
tr: Günlük

source: Weekly
tr: Haftalık

source: Challenges
tr: Macereler

# challengesIntro
source: Build habits with structured challenges. Complete all goals to earn bonus XP.
tr: Yapılandırılmış maceralarla alışkanlık edinin. Tüm hedefleri tamamlayarak bonus XP kazanın.

# challengesEmpty
source: No challenges right now. Create goals from the dashboard to get started.
tr: Şu an macera bulunmuyor. Başlamak için panelden hedef oluşturabilirsiniz.

# challengesEmptyTitle
source: No challenges yet
tr: Henüz macera yok

# challengesNoActiveTitle
source: No Active Challenges Yet
tr: Henüz Aktif Macera Yok

# challengesNoActiveSubtitle
source: Start your first 7-day challenge to begin earning bonus XP.
tr: Bonus XP kazanmaya başlamak için ilk 7 günlük maceranıza başlayın.

# challengesNoActiveSubtitleShort
source: Start your first 7-day challenge.
tr: İlk 7 günlük maceranıza başlayın.

source: Browse Challenges
tr: Maceralara Göz At

# activeChallengesSection
source: Active Challenges
tr: Aktif Maceralar

# startNewChallengeSection
source: Start a New Challenge
tr: Yeni Macera Başlat

source: Scroll to templates
tr: Şablonlara git

# startChallengeButton
source: Start Challenge
tr: Macerayı Başlat

# challengesLoadError
source: Could not load challenges. Pull to try again.
tr: Maceralar yüklenemedi. Tekrar denemek için çekin.

# daysBonusXp
source: {days} days · {xp} bonus XP
tr: {days} gün · {xp} bonus XP

source: Active goals
tr: Aktif hedefler

source: Today's Suggested Goals
tr: Bugünün Önerilen Hedefleri

# reminderBannerMessage
source: You haven't completed today's goals yet.
tr: Bugünkü hedeflerinizi henüz tamamlamadınız.

source: Daily reminders
tr: Günlük hatırlatmalar

source: Enable daily reminder
tr: Günlük hatırlatmayı aç

source: Reminder time
tr: Hatırlatma saati

source: Recommended challenges
tr: Önerilen maceralar

source: Recommended goals
tr: Önerilen hedefler

# startChallenge
source: Start Goal
tr: Macera başlat

# dayProgress
source: Day {current} / {total}
tr: Gün {current} / {total}

# daysLeft
source: {count} days left
tr: {count} gün kaldı

# daysCompleted
source: {count} days completed
tr: {count} gün tamamlandı

source: Complete
tr: Tamamla

source: Done
tr: Tamamlandı

# noActiveGoals
source: No active goals yet. Tap + to create your first one.
tr: Henüz aktif hedef yok. İlk hedefinizi oluşturmak için + dokunun.

# noActiveGoalsTitle
source: No goals yet
tr: Henüz hedef yok

# noActiveGoalsDescription
source: Create your first goal to start earning XP and building streaks.
tr: XP kazanmak ve seri oluşturmak için ilk hedefinizi ekleyin.

source: Goals completed
tr: Tamamlanan hedef

source: Current streak
tr: Mevcut seri

source: Completed today
tr: Bugün tamamlanan

# daysSuffix
source: days
tr: gün

source: Premium Feature
tr: Premium özellik

# advancedStatsDesc
source: Weekly average, most productive category, 30-day trend
tr: Haftalık ortalama, en verimli kategori, 30 günlük trend

source: Upgrade
tr: Yükselt

# unlockPotential
source: Unlock your full potential
tr: Potansiyelinizi açığa çıkarın

source: You have Premium
tr: Premium üyeliğiniz var

source: Premium activated
tr: Premium etkinleştirildi

source: Something went wrong
tr: Bir şeyler yanlış gitti

# invalidEmailPassword
source: Invalid email or password.
tr: Geçersiz e-posta veya şifre.

# confirmEmailFirst
source: Please confirm your email before signing in.
tr: Giriş yapmadan önce e-postanızı onaylayın.

# emailAlreadyRegistered
source: This email is already registered.
tr: Bu e-posta zaten kayıtlı.

# passwordMinLength
source: Password should be at least 6 characters.
tr: Şifre en az 6 karakter olmalıdır.

# passwordTooWeak
source: Password is too weak. Use at least 6 characters.
tr: Şifre çok zayıf. En az 6 karakter kullanın.

# tooManyAttempts
source: Too many attempts. Please try again in a few minutes.
tr: Çok fazla deneme. Birkaç dakika sonra tekrar deneyin.

# tryAgain
source: Something went wrong. Try again.
tr: Bir şeyler yanlış gitti. Tekrar deneyin.

# min6Chars
source: Min 6 characters
tr: En az 6 karakter

# levelLabel
source: Level {level}
tr: Seviye {level}

# levelUpTitle
source: Level Up!
tr: Seviye atladın!

# levelUpMessage
source: You reached level {level}. Keep going!
tr: Seviye {level} oldun. Devam et!

# dailyXpAvailable
source: Daily XP available: {xp}
tr: Bugün alınabilecek XP: {xp}

# completedTodayCount
source: Completed today
tr: Bugün tamamlanan

# todayAlreadyCompleted
source: Already completed today.
tr: Bugün zaten tamamlandı.

source: Goal not found.
tr: Hedef bulunamadı.

source: Study
tr: Çalışma

source: Work
tr: İş

source: Focus
tr: Odak

source: Mind
tr: Zihin

source: Health
tr: Sağlık

source: Finance
tr: Finans

source: Self Growth
tr: Kişisel gelişim

source: General
tr: Genel

source: Digital Detox
tr: Dijital Detoks

source: Social
tr: Sosyal

source: Creativity
tr: Yaratıcılık

source: Discipline
tr: Disiplin

source: Easy
tr: Kolay

source: Medium
tr: Orta

source: Hard
tr: Zor

# easyXp
source: Easy (10 XP)
tr: Kolay (10 XP)

# mediumXp
source: Medium (25 XP)
tr: Orta (25 XP)

# hardXp
source: Hard (50 XP)
tr: Zor (50 XP)

source: Language
tr: Dil

source: System default
tr: Sistem varsayılanı

# xpEarnedLevelUp
source: +{xp} XP — Level Up! (Lv {level})
tr: +{xp} XP — Seviye atladın! (Sev. {level})

source: Active challenge
tr: Aktif macera

source: Challenges completed
tr: Tamamlanan maceralar

source: Completions by category
tr: Kategoriye göre tamamlamalar

source: Advanced stats
tr: Gelişmiş istatistikler

source: Weekly XP
tr: Haftalık XP

source: Most productive category
tr: En verimli kategori

source: Last 30 days
tr: Son 30 gün

source: Challenge not found
tr: Macera bulunamadı

source: Goals in this challenge
tr: Bu maceradaki hedefler

source: Challenge completed!
tr: Macera tamamlandı!

# bonusXpAddedWhenFinished
source: +{xp} XP was added when you finished.
tr: Bitirdiğinizde +{xp} XP eklendi.

source: You are doing this challenge
tr: Bu macerayı yapıyorsunuz

# alreadyHaveActiveChallenge
source: You already have an active challenge.
tr: Zaten aktif bir maceranız var.

# challengeStartedMessage
source: {title} started! Complete 1 goal per day to earn {xp} bonus XP.
tr: {title} başlatıldı! Günde 1 hedef tamamlayarak {xp} bonus XP kazanın.

# challengeStartedMessageOffline
source: {title} started! Complete goals to earn {xp} bonus XP.
tr: {title} başlatıldı! Hedefleri tamamlayarak {xp} bonus XP kazanın.

source: Claim bonus
tr: Bonusu al

# claimBonusXp
source: Claim {xp} bonus XP
tr: {xp} bonus XP al

# bonusXpClaimed
source: +{xp} bonus XP claimed!
tr: +{xp} bonus XP alındı!

source: Progress: {percent}%
tr: İlerleme: %{percent}

# daysCount
source: {count} days
tr: {count} gün

source: Benefits
tr: Avantajlar

source: Unlimited Goals
tr: Sınırsız hedef

source: Streak Protection
tr: Seri koruması

# premiumPurchasesMobileOnly
source: Premium purchases available on mobile only.
tr: Premium satın alma yalnızca mobilde kullanılabilir.

source: Dev: Premium enabled
tr: Geliştirici: Premium etkinleştirildi

source: Dev: Enable Premium
tr: Geliştirici: Premium'u etkinleştir

source: Restore purchases
tr: Satın almaları geri yükle

source: Restore requested
tr: Geri yükleme isteği gönderildi

source: Monthly
tr: Aylık

source: Yearly
tr: Yıllık

source: Buy
tr: Satın al

source: Unknown routing error
tr: Bilinmeyen yönlendirme hatası
